Revit 2024 API
AnalysisDisplayVectorSettings.VectorPosition Property
 Vector position.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public AnalysisDisplayStyleVectorPosition VectorPosition { get; set; }
Visual Basic
Public Property VectorPosition As AnalysisDisplayStyleVectorPosition
	Get
	Set
Visual C++
public:
property AnalysisDisplayStyleVectorPosition VectorPosition {
	AnalysisDisplayStyleVectorPosition get ();
	void set (AnalysisDisplayStyleVectorPosition value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalysisDisplayVectorSettings Class
Autodesk.Revit.DB.Analysis Namespace